{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.38/4.0"
      ],
      "degree": "Master of Engineering",
      "department": "Computer Engineering",
      "duration": "2022-2024",
      "school_name": "University of Guelph"
    },
    {
      "awards_achievements": [
        "GPA: 3.79/4.0"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Information Technology",
      "duration": "2017-2021",
      "school_name": "Gujarat Technological University (GTU)"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KhushaliMehta",
  "highlighted_projects": [
    {
      "description": "Developed a traffic sign recognition system utilizing a Convolutional Neural Network (CNN), renowned for its effectiveness in image analysis. Selected a comprehensive dataset from the Kaggle website, comprising nearly 50,000 images of traffic signs for training and testing purposes. Upon completion of the model's training phase, it demonstrated a remarkable 96% accuracy rate, underscoring its capability to reliably identify traffic signs.",
      "name": "Traffic Sign Recognition using Deep Neural Networks"
    },
    {
      "description": "Constructed a language detection system utilizing the Multinomial Naïve Bayes (MNB) methodology to accurately classify the language of any given text. This system was trained on a Kaggle dataset featuring 17-18 unique languages, each represented by at least 1000 lines of text. Through the application and evaluation of various algorithms, it was highlighted that the MNB approach outperformed others, achieving the highest accuracy rate of 95%.",
      "name": "Language Detection using Machine Learning"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Linux Cluster Monitoring Project is aimed at supporting the Business Systems Analysis (BSA) work, focusing on the elicitation and analysis of requirements from stakeholders. In this context, the BSA plays a crucial role in drafting the Business Requirements Document (BRD) and System Requirements Document (SRD), ensuring that the project aligns with the stakeholders' needs. Through detailed requirement analysis, the project emphasizes the importance of RDBMS and SQL for efficient data management and modeling. The project's design allows network and system administrators to monitor hardware specifications and memory usage, using technologies like Docker, PostgreSQL, and shell scripts. In the BSA context, establishing Service Level Agreements (SLA) is vital to maintain the performance and reliability of the monitoring system, ensuring that the project meets the predefined standards and expectations of the stakeholders.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_KhushaliMehta/tree/develop/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Khushali Mehta",
  "others": [
    {
      "bullets": [
        "Microsoft Azure Fundamentals (AZ900) - Official certification offered by Microsoft",
        "Python for Everybody - A Python Specialization on Coursera",
        "MongoDB Basics (M001) - offered by MongoDB"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Self-taught photographer, watch the glimpse here https://vs.co/kglfi1pz ",
        "Lecturer, to freshman year students on topic Life SKills",
        "Joint Workshop Coordinator, in a college event",
        "Volunteer, an NGO named National Service Scheme (NSS)"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "As a consultant, I work on multiple projects and focus on its implementation. I recently worked on the Linux Cluster Monitoring Project and developed a system to store and analyze hardware specifications of Linux nodes and its memory usage information in real time. I have documented the README file of the project and deployed the project on GitHub",
      "duration": "2024-present",
      "title": "Technical Consultant"
    },
    {
      "company": "Tata Consultancy Services (TCS)",
      "description": "Participated in the Microsoft Business Unit (MBU) and worked on the Pandora AMS project. Monitored system operations and client applications on Production Servers, identifying and mitigating potential issues, resulting in a 5% reduction in errors. Developed and deployed automated server health checks and error monitoring systems, which led to a 20% decrease in downtime and enhanced client satisfaction through timely error notifications. Refined SQL queries for data extraction from the database, delivering valuable insights to the business as required.",
      "duration": "2021-2022",
      "title": "Assistant Systems Engineer Trainee"
    }
  ],
  "skills": {
    "Business Skills": [
      "Communication",
      "Collaboration",
      "Time management",
      "MS Office",
      "Google Workspace"
    ],
    "Technical Skills": [
      "RDBMS/SQL",
      "Data Analytics",
      "Python",
      "MongoDB",
      "Docker",
      "GIT",
      "Linux"
    ]
  },
  "summary": "Highly motivated graduate with a Master's in Computer Engineering from the University of Guelph, and over two years of experience in Python and MySQL. My academic and work history has honed my skills in backend development and database management, making me a strong candidate for roles in software development and data engineering. My passion lies in utilizing my technical skills to solve complex problems and improve system efficiencies, which I demonstrated during my tenure at Tata Consultancy Services by enhancing server performance and reducing errors. I'm open to work for a BSA / data engineer role where I can leverage my technical expertise in programming and problem-solving abilities. My educational background, coupled with practical experience in software development and system optimization, positions me as a suitable candidate for your team."
}
